In [2]:
import pandas as pd

In [18]:
pd.Series([1,"kk",3,4,5])

0     1
1    kk
2     3
3     4
4     5
dtype: object

In [28]:
seri = pd.Series([1,"kkl",11.8,4,5])

In [30]:
type(seri)

pandas.core.series.Series

In [32]:
seri.axes

[RangeIndex(start=0, stop=5, step=1)]

In [34]:
seri.dtype

dtype('O')

In [36]:
seri.ndim

1

In [38]:
seri.values

array([1, 'kkl', 11.8, 4, 5], dtype=object)

In [44]:
seri.head(3)

0       1
1     kkl
2    11.8
dtype: object

In [46]:
seri.tail(3)

2    11.8
3       4
4       5
dtype: object

In [48]:
#indeks isimlendirme

In [54]:
pd.Series([12,43,44,2112,0,5], index = [1,3,5,7,9,11])

1       12
3       43
5       44
7     2112
9        0
11       5
dtype: int64

In [56]:
pd.Series([12,43,44,2112,0,5], index = ["a","b","c","d","e","f"])

a      12
b      43
c      44
d    2112
e       0
f       5
dtype: int64

In [58]:
seri = pd.Series([12,43,44,2112,0,5], index = ["a","b","c","d","e","f"])

In [60]:
seri["a"]

12

In [62]:
seri["a":"c"]

a    12
b    43
c    44
dtype: int64

In [64]:
#sozluk uzerinden liste olusturma

In [66]:
sozluk = {"reg":10, "log":11, "cart": 12}

In [68]:
seri = pd.Series(sozluk)

In [72]:
seri

reg     10
log     11
cart    12
dtype: int64

In [74]:
#iki seriyi birleştirerek seri oluşturma

In [77]:
pd.concat([seri, seri])

reg     10
log     11
cart    12
reg     10
log     11
cart    12
dtype: int64

In [ ]:
pd.concat

## Eleman işlemleri

In [7]:
import numpy as np
import pandas as pd

In [5]:
a = np.array([1,2,33,444,75])

In [9]:
seri = pd.Series(a)
seri

0      1
1      2
2     33
3    444
4     75
dtype: int32

In [13]:
seri[0]

1

In [17]:
seri[0:3]

0     1
1     2
2    33
dtype: int32

In [19]:
seri = pd.Series([24,5,23,65], index= ["reg","loj","cart", "rf"])

In [21]:
seri

reg     24
loj      5
cart    23
rf      65
dtype: int64

In [23]:
seri.index

Index(['reg', 'loj', 'cart', 'rf'], dtype='object')

In [27]:
seri.keys

<bound method Series.keys of reg     24
loj      5
cart    23
rf      65
dtype: int64>

In [29]:
list(seri.items())

[('reg', 24), ('loj', 5), ('cart', 23), ('rf', 65)]

In [33]:
print(seri.values)

[24  5 23 65]

In [35]:
#eleman sorgulama

In [37]:
"reg" in seri

True

In [39]:
"Reg" in seri

False

In [41]:
seri["reg"]

24

In [43]:
#fancy eleman

In [45]:
seri[["rf", "reg"]]

rf     65
reg    24
dtype: int64

In [49]:
seri["reg"] = 30

In [51]:
seri

reg     30
loj      5
cart    23
rf      65
dtype: int64

In [53]:
seri["reg":"loj"]

reg    30
loj     5
dtype: int64

## Pandas DataFrame oluşturma

In [56]:
#pandasta farklı veriler birlikte tutulabilir numpy yapamıyordu

In [58]:
import pandas as pd

In [60]:
l = [1,2,39,67,90]

In [62]:
l

[1, 2, 39, 67, 90]

In [64]:
pd.DataFrame(l, columns =["degisken_ismi"])

   degisken_ismi
0              1
1              2
2             39
3             67
4             90

In [70]:
import numpy as np
m = np.arange(1,10).reshape((3,3))
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [72]:
pd.DataFrame(m, columns =["var1","var2","var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [74]:
#df isimlendirme

In [76]:
df = pd.DataFrame(m, columns =["var1","var2","var3"])
df.head()

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [80]:
df.columns = ("deg1", "deg2", "deg3")

In [83]:
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [85]:
type(df)

pandas.core.frame.DataFrame

In [87]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg1', 'deg2', 'deg3'], dtype='object')]

In [89]:
df.shape

(3, 3)

In [99]:
df.ndim
#her zaman 2dir

2

In [93]:
df.size

9

In [95]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [101]:
type(df.values)

numpy.ndarray

In [105]:
df.tail(1)

   deg1  deg2  deg3
2     7     8     9

In [107]:
df.head(1)

   deg1  deg2  deg3
0     1     2     3

In [109]:
a = np.array([1,2,3,4,5])

In [115]:
pd.DataFrame(a, columns = ["d1"])

   d1
0   1
1   2
2   3
3   4
4   5

## Eleman işlemleri ##

In [3]:
import numpy as np

s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

In [5]:
sozluk = {"var1": s1, "var2": s2, "var3": s3 }

In [7]:
sozluk

{'var1': array([1, 6, 0, 5, 9]),
 'var2': array([5, 2, 6, 3, 8]),
 'var3': array([2, 2, 2, 2, 0])}

In [13]:
import pandas as pd
df = pd.DataFrame(sozluk)

In [15]:
df

   var1  var2  var3
0     1     5     2
1     6     2     2
2     0     6     2
3     5     3     2
4     9     8     0

In [17]:
df[0:1]

   var1  var2  var3
0     1     5     2

In [20]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [22]:
df.index = ["a","b", "c", "d","e"]

In [24]:
df

   var1  var2  var3
a     1     5     2
b     6     2     2
c     0     6     2
d     5     3     2
e     9     8     0

In [26]:
df["c":"e"]

   var1  var2  var3
c     0     6     2
d     5     3     2
e     9     8     0

In [28]:
#delete

In [44]:
df.drop("a", axis=0)

   var1  var2  var3
b     6     2     2
c     0     6     2
d     5     3     2
e     9     8     0

In [38]:
df.drop("b")

   var1  var2  var3
a     1     5     2
c     0     6     2
d     5     3     2
e     9     8     0

In [40]:
df

   var1  var2  var3
a     1     5     2
b     6     2     2
c     0     6     2
d     5     3     2
e     9     8     0

In [50]:
df.drop("var1", axis=1, inplace=True)

In [52]:
df

   var2  var3
b     2     2
c     6     2
d     3     2
e     8     0

In [54]:
df

   var2  var3
b     2     2
c     6     2
d     3     2
e     8     0

In [56]:
#fancy

In [58]:
l = ["c", "e"]

In [60]:
df.drop(l, axis=0)

   var2  var3
b     2     2
d     3     2

In [62]:
#for variables

In [64]:
"var3" in df

True

In [66]:
l = ["var2","var3", "var4"]

In [78]:
for i in l:
    print(i in df)

True
True
False

In [80]:
df

   var2  var3
b     2     2
c     6     2
d     3     2
e     8     0

In [106]:
df["var4"] = df["var2"]*df["var3"]

In [108]:
df

   var2  var3  var4
b     2     2     4
c     6     2    12
d     3     2     6
e     8     0     0

In [114]:
df.drop("var4", axis=1, inplace= True)

In [116]:
df

   var2  var3
b     2     2
c     6     2
d     3     2
e     8     0

In [126]:
l = ["var2", "var3"]

In [128]:
df.drop(l, axis = 1)

Empty DataFrame
Columns: []
Index: [b, c, d, e]

In [130]:
df

   var2  var3
b     2     2
c     6     2
d     3     2
e     8     0

## loc and iloc ##

In [134]:
import numpy as np
import pandas as pd

m = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(m, columns = ["var1", "var2", "var3"])

In [136]:
df

   var1  var2  var3
0    11    12    29
1     4    24    21
2    23    11     1
3    16    12     9
4    27    14    21
5    19     2    16
6    23     9     3
7    25    18     5
8    14    26    25
9    13     3    17

In [156]:
#loc: for choosing (indexes are match one-to-one with values )

In [144]:
df.loc[0:3]

   var1  var2  var3
0    11    12    29
1     4    24    21
2    23    11     1
3    16    12     9

In [154]:
#iloc: also for choosing but it uses index logic(starting 0 and last index is not included)

In [150]:
df.iloc[0:3]

   var1  var2  var3
0    11    12    29
1     4    24    21
2    23    11     1

In [158]:
df.iloc[0,0]

11

In [160]:
df.iloc[:3,:2]

   var1  var2
0    11    12
1     4    24
2    23    11

In [162]:
df.loc[:3,"var3"]

0    29
1    21
2     1
3     9
Name: var3, dtype: int32

In [168]:
#df.iloc[:3,"var3"]
#we can use just indexes, "var3" is cannot choose with iloc, use loc

In [170]:
df.iloc[0:3]["var3"]

0    29
1    21
2     1
Name: var3, dtype: int32

## Conditional process ##

In [174]:
import numpy as np
import pandas as pd

m = np.random.randint(1,30, size= (10,3))
df = pd.DataFrame(m, columns = ["var1","var2","var3"])

In [176]:
df

   var1  var2  var3
0    20     5    12
1    23    13    17
2     9    19    25
3    29    25     7
4    18    12    19
5    29     2    29
6     4    24    26
7    27    14    12
8     7     6    13
9    27    10    24

In [178]:
df["var1"]

0    20
1    23
2     9
3    29
4    18
5    29
6     4
7    27
8     7
9    27
Name: var1, dtype: int32

In [186]:
df["var1"][0:2]

0    20
1    23
Name: var1, dtype: int32

In [194]:
df[0:2][["var1"]]

   var1
0    20
1    23

In [190]:
df[0:2][["var1","var2"]]

   var1  var2
0    20     5
1    23    13

In [196]:
df.var1

0    20
1    23
2     9
3    29
4    18
5    29
6     4
7    27
8     7
9    27
Name: var1, dtype: int32

In [200]:
df[df.var1 > 15]

   var1  var2  var3
0    20     5    12
1    23    13    17
3    29    25     7
4    18    12    19
5    29     2    29
7    27    14    12
9    27    10    24

In [202]:
df[df.var1 > 15]["var1"]

0    20
1    23
3    29
4    18
5    29
7    27
9    27
Name: var1, dtype: int32

In [222]:
df[(df.var1 > 5) & (df.var3 < 15)]

   var1  var2  var3
0    20     5    12
3    29    25     7
7    27    14    12
8     7     6    13

In [ ]:
df[(df.var1 > 15),["var1","var2"]]
#there is error, we can fix it with using loc

In [224]:
df.loc[(df.var1 > 15),["var1","var2"]]

   var1  var2
0    20     5
1    23    13
3    29    25
4    18    12
5    29     2
7    27    14
9    27    10

In [230]:
df[(df.var1 > 15)][["var1","var2"]]
#other way(without loc)

   var1  var2
0    20     5
1    23    13
3    29    25
4    18    12
5    29     2
7    27    14
9    27    10

## Join

In [247]:
import numpy as np
import pandas as pd

m = np.random.randint(1,30, size=(5,3))
df1 = pd.DataFrame(m, columns = ["var1","var2","var3"])

In [249]:
df1

   var1  var2  var3
0    14    11    13
1    13     3    12
2    18    23    14
3    23    19     2
4    11    14    16

In [253]:
df2 = df1 + 99

In [256]:
df2

   var1  var2  var3
0   113   110   112
1   112   102   111
2   117   122   113
3   122   118   101
4   110   113   115

In [268]:
pd.concat([df1,df2] )

   var1  var2  var3
0    14    11    13
1    13     3    12
2    18    23    14
3    23    19     2
4    11    14    16
0   113   110   112
1   112   102   111
2   117   122   113
3   122   118   101
4   110   113   115

In [260]:
?pd.concat

Signature:
pd.concat(
    objs: 'Iterable[Series | DataFrame] | Mapping[HashableT, Series | DataFrame]',
    *,
    axis: 'Axis' = 0,
    join: 'str' = 'outer',
    ignore_index: 'bool' = False,
    keys: 'Iterable[Hashable] | None' = None,
    levels=None,
    names: 'list[HashableT] | None' = None,
    verify_integrity: 'bool' = False,
    sort: 'bool' = False,
    copy: 'bool | None' = None,
) -> 'DataFrame | Series'
Docstring:
Concatenate pandas objects along a particular axis.

Allows optional set logic along the other axes.

Can also add a layer of hierarchical indexing on the concatenation axis,
which may be useful if the labels are the same (or overlapping) on
the passed axis number.

Parameters
----------
objs : a sequence or mapping of Series or DataFrame objects
    If a mapping is passed, the sorted keys will be used as the `keys`
    argument, unless it is passed, in which case the values will be
    selected (see below). Any None objects will be dropped silently unless
    they are all None in which case a ValueError will be raised.
axis : {0/'index', 1/'columns'}, default 0
    The axis to concatenate along.
join : {'inner', 'outer'}, default 'outer'
    How to handle indexes on other axis (or axes).
ignore_index : bool, default False
    If True, do not use the index values along the concatenation axis. The
    resulting axis will be labeled 0, ..., n - 1. This is useful if you are
    concatenating objects where the concatenation axis does not have
    meaningful indexing information. Note the index values on the other
    axes are still respected in the join.
keys : sequence, default None
    If multiple levels passed, should contain tuples. Construct
    hierarchical index using the passed keys as the outermost level.
levels : list of sequences, default None
    Specific levels (unique values) to use for constructing a
    MultiIndex. Otherwise they will be inferred from the keys.
names : list, default None
    Names for the levels in the resulting hierarchical index.
verify_integrity : bool, default False
    Check whether the new concatenated axis contains duplicates. This can
    be very expensive relative to the actual data concatenation.
sort : bool, default False
    Sort non-concatenation axis if it is not already aligned. One exception to
    this is when the non-concatentation axis is a DatetimeIndex and join='outer'
    and the axis is not already aligned. In that case, the non-concatenation
    axis is always sorted lexicographically.
copy : bool, default True
    If False, do not copy data unnecessarily.

Returns
-------
object, type of objs
    When concatenating all ``Series`` along the index (axis=0), a
    ``Series`` is returned. When ``objs`` contains at least one
    ``DataFrame``, a ``DataFrame`` is returned. When concatenating along
    the columns (axis=1), a ``DataFrame`` is returned.

See Also
--------
DataFrame.join : Join DataFrames using indexes.
DataFrame.merge : Merge DataFrames by indexes or columns.

Notes
-----
The keys, levels, and names arguments are all optional.

A walkthrough of how this method fits in with other tools for combining
pandas objects can be found `here
<https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html>`__.

It is not recommended to build DataFrames by adding single rows in a
for loop. Build a list of rows and make a DataFrame in a single concat.

Examples
--------
Combine two ``Series``.

>>> s1 = pd.Series(['a', 'b'])
>>> s2 = pd.Series(['c', 'd'])
>>> pd.concat([s1, s2])
0    a
1    b
0    c
1    d
dtype: object

Clear the existing index and reset it in the result
by setting the ``ignore_index`` option to ``True``.

>>> pd.concat([s1, s2], ignore_index=True)
0    a
1    b
2    c
3    d
dtype: object

Add a hierarchical index at the outermost level of
the data with the ``keys`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'])
s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

Label the index keys you create with the ``names`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'],
...           names=['Series name', 'Row ID'])
Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

Combine two ``DataFrame`` objects with identical columns.

>>> df1 = pd.DataFrame([['a', 1], ['b', 2]],
...                    columns=['letter', 'number'])
>>> df1
  letter  number
0      a       1
1      b       2
>>> df2 = pd.DataFrame([['c', 3], ['d', 4]],
...                    columns=['letter', 'number'])
>>> df2
  letter  number
0      c       3
1      d       4
>>> pd.concat([df1, df2])
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects with overlapping columns
and return everything. Columns outside the intersection will
be filled with ``NaN`` values.

>>> df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
...                    columns=['letter', 'number', 'animal'])
>>> df3
  letter  number animal
0      c       3    cat
1      d       4    dog
>>> pd.concat([df1, df3], sort=False)
  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

Combine ``DataFrame`` objects with overlapping columns
and return only those that are shared by passing ``inner`` to
the ``join`` keyword argument.

>>> pd.concat([df1, df3], join="inner")
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects horizontally along the x axis by
passing in ``axis=1``.

>>> df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
...                    columns=['animal', 'name'])
>>> pd.concat([df1, df4], axis=1)
  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

Prevent the result from including duplicate index values with the
``verify_integrity`` option.

>>> df5 = pd.DataFrame([1], index=['a'])
>>> df5
   0
a  1
>>> df6 = pd.DataFrame([2], index=['a'])
>>> df6
   0
a  2
>>> pd.concat([df5, df6], verify_integrity=True)
Traceback (most recent call last):
    ...
ValueError: Indexes have overlapping values: ['a']

Append a single row to the end of a ``DataFrame`` object.

>>> df7 = pd.DataFrame({'a': 1, 'b': 2}, index=[0])
>>> df7
    a   b
0   1   2
>>> new_row = pd.Series({'a': 3, 'b': 4})
>>> new_row
a    3
b    4
dtype: int64
>>> pd.concat([df7, new_row.to_frame().T], ignore_index=True)
    a   b
0   1   2
1   3   4
File:      c:\users\acer\anaconda3\lib\site-packages\pandas\core\reshape\concat.py
Type:      function

In [270]:
pd.concat([df1,df2], ignore_index= True )

   var1  var2  var3
0    14    11    13
1    13     3    12
2    18    23    14
3    23    19     2
4    11    14    16
5   113   110   112
6   112   102   111
7   117   122   113
8   122   118   101
9   110   113   115

In [274]:
df1.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [278]:
df2.columns = ["var1","var2","deg3"]

In [280]:
df2

   var1  var2  deg3
0   113   110   112
1   112   102   111
2   117   122   113
3   122   118   101
4   110   113   115

In [282]:
pd.concat([df1,df2])

   var1  var2  var3   deg3
0    14    11  13.0    NaN
1    13     3  12.0    NaN
2    18    23  14.0    NaN
3    23    19   2.0    NaN
4    11    14  16.0    NaN
0   113   110   NaN  112.0
1   112   102   NaN  111.0
2   117   122   NaN  113.0
3   122   118   NaN  101.0
4   110   113   NaN  115.0

In [286]:
pd.concat([df1,df2], join = "inner")
# join intersection

   var1  var2
0    14    11
1    13     3
2    18    23
3    23    19
4    11    14
0   113   110
1   112   102
2   117   122
3   122   118
4   110   113

In [292]:
#pd.concat([df1,df2], join_axes = [df2.columns])

TypeError: concat() got an unexpected keyword argument 'join_axes'

In [310]:
pd.concat([df1, df2], axis = 0, ignore_index= True).reindex(columns=df2.columns)

   var1  var2   deg3
0    14    11    NaN
1    13     3    NaN
2    18    23    NaN
3    23    19    NaN
4    11    14    NaN
5   113   110  112.0
6   112   102  111.0
7   117   122  113.0
8   122   118  101.0
9   110   113  115.0

In [312]:
# advanced join scenarios

In [355]:
df1 = pd.DataFrame({"calisanlar": ["Ali", "Veli", "Ayse", "Fatma"],
                    "grup": ["Muhasebe", "Muhendislik", "Muhendislik", "IK"]})

In [357]:
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           IK

In [384]:
df2 = pd.DataFrame({"calisanlar": ["Ali", "Veli", "Ayse", "Fatma"],
                    "ilk_giris": [2019,2009,2014,2019]})

In [386]:
df2

  calisanlar  ilk_giris
0        Ali       2019
1       Veli       2009
2       Ayse       2014
3      Fatma       2019

In [387]:
pd.merge(df1,df2)

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2019
1       Veli  Muhendislik       2009
2       Ayse  Muhendislik       2014
3      Fatma           IK       2019

In [389]:
pd.merge(df1,df2, on = "calisanlar")

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2019
1       Veli  Muhendislik       2009
2       Ayse  Muhendislik       2014
3      Fatma           IK       2019

In [391]:
# many to one

In [392]:
df3 = pd.merge(df1,df2)

In [393]:
df3

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2019
1       Veli  Muhendislik       2009
2       Ayse  Muhendislik       2014
3      Fatma           IK       2019

In [395]:
df4 = pd.DataFrame({"grup": ["Muhasebe","Muhendislik","IK"],
                    "mudur": ["Sude", "Azra", "Dilara"]})

In [396]:
df4

          grup   mudur
0     Muhasebe    Sude
1  Muhendislik    Azra
2           IK  Dilara

In [397]:
pd.merge(df3,df4)

  calisanlar         grup  ilk_giris   mudur
0        Ali     Muhasebe       2019    Sude
1       Veli  Muhendislik       2009    Azra
2       Ayse  Muhendislik       2014    Azra
3      Fatma           IK       2019  Dilara

In [398]:
# many to many

In [414]:
df5 = pd.DataFrame({"grup": ["Muhasebe", "Muhasebe", "Muhendislik", "Muhendislik", "IK", "IK"],
                    "yetenekler": ["matematik", "excel", "kodlama", "linux", "excel", "yonetim"]})

In [417]:
df5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Muhendislik    kodlama
3  Muhendislik      linux
4           IK      excel
5           IK    yonetim

In [419]:
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           IK

In [421]:
pd.merge(df1,df5)

  calisanlar         grup yetenekler
0        Ali     Muhasebe  matematik
1        Ali     Muhasebe      excel
2       Veli  Muhendislik    kodlama
3       Veli  Muhendislik      linux
4       Ayse  Muhendislik    kodlama
5       Ayse  Muhendislik      linux
6      Fatma           IK      excel
7      Fatma           IK    yonetim

## Aggregation & Grouping

In [425]:
import seaborn as sns
df = sns.load_dataset("planets")

In [429]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [431]:
df.shape

(1035, 6)

In [437]:
df.mean(   numeric_only= True)

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [435]:
df["mass"].mean()

2.6381605847953216

In [439]:
df["mass"].count()

513

In [441]:
df["mass"].min()

0.0036

In [443]:
df["mass"].max()

25.0

In [447]:
df["mass"].sum()

1353.37638

In [451]:
df["mass"].std()

3.8186166509616046

In [453]:
df["mass"].var()

14.58183312700122

In [455]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [457]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [459]:
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

## Grouping

In [462]:
import pandas as pd
import numpy as np

In [472]:
df = pd.DataFrame({"gruplar": ["A","B","C","A","B","C"],
                   "veri": [10,11,52,23,43,55]}, columns = ["gruplar", "veri"])

In [474]:
df

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [476]:
df.groupby("gruplar")

In [478]:
df.groupby("gruplar").mean()

         veri
gruplar
A        16.5
B        27.0
C        53.5

In [480]:
df.groupby("gruplar").sum()

         veri
gruplar
A          33
B          54
C         107

In [482]:
import seaborn as sns
df = sns.load_dataset("planets")

In [484]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [488]:
df.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [490]:
df.groupby("method")["orbital_period"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

## aggregate, filter, transform, apply

In [501]:
import pandas as pd
df = pd.DataFrame({"gruplar": ["A","B","C","A","B","C"],
                   "degisken1": [10,23,33,33,11,99],
                   "degisken2": [200,253,333,262,111,969]},
                    columns = ["gruplar", "degisken1", "degisken2"])

In [503]:
df

  gruplar  degisken1  degisken2
0       A         10        200
1       B         23        253
2       C         33        333
3       A         33        262
4       B         11        111
5       C         99        969

In [505]:
# aggregate

In [509]:
df.groupby("gruplar").mean()

         degisken1  degisken2
gruplar
A             21.5      231.0
B             17.0      182.0
C             66.0      651.0

In [511]:
df.groupby("gruplar").aggregate(["min", np.median, max])

C:\Users\acer\AppData\Local\Temp\ipykernel_120592\1569478810.py:1: FutureWarning: The provided callable <function median at 0x0000026D7A77B9C0> is currently using SeriesGroupBy.median. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "median" instead.
  df.groupby("gruplar").aggregate(["min", np.median, max])
C:\Users\acer\AppData\Local\Temp\ipykernel_120592\1569478810.py:1: FutureWarning: The provided callable <built-in function max> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  df.groupby("gruplar").aggregate(["min", np.median, max])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10   21.5  33       200  231.0  262
B              11   17.0  23       111  182.0  253
C              33   66.0  99       333  651.0  969

In [515]:
df.groupby("gruplar").aggregate(["min", np.median, "max"])

C:\Users\acer\AppData\Local\Temp\ipykernel_120592\82901036.py:1: FutureWarning: The provided callable <function median at 0x0000026D7A77B9C0> is currently using SeriesGroupBy.median. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "median" instead.
  df.groupby("gruplar").aggregate(["min", np.median, "max"])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10   21.5  33       200  231.0  262
B              11   17.0  23       111  182.0  253
C              33   66.0  99       333  651.0  969

In [517]:
df.groupby("gruplar").aggregate(["min", "median", "max"])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10   21.5  33       200  231.0  262
B              11   17.0  23       111  182.0  253
C              33   66.0  99       333  651.0  969

In [519]:
df.groupby("gruplar").aggregate({"degisken1": "min", "degisken2":"max"})

         degisken1  degisken2
gruplar
A               10        262
B               11        253
C               33        969

In [531]:
# filter

In [546]:
import pandas as pd
df = pd.DataFrame({"gruplar": ["A","B","C","A","B","C"],
                   "degisken1": [10,23,33,22,11,99],
                   "degisken2": [100,253,333,262,111,969]},
                    columns = ["gruplar", "degisken1", "degisken2"])

In [548]:
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [571]:
def filter_func(x):
    return x["degisken1"].std() > 9

In [573]:
df.groupby("gruplar").std()

         degisken1   degisken2
gruplar
A         8.485281  114.551299
B         8.485281  100.409163
C        46.669048  449.719913

In [575]:
df.groupby("gruplar").filter(filter_func)

  gruplar  degisken1  degisken2
2       C         33        333
5       C         99        969

In [578]:
# transform

In [580]:
import pandas as pd
df = pd.DataFrame({"gruplar": ["A","B","C","A","B","C"],
                   "degisken1": [10,23,33,22,11,99],
                   "degisken2": [100,253,333,262,111,969]},
                    columns = ["gruplar", "degisken1", "degisken2"])

In [582]:
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [584]:
df["degisken1"]*9

0     90
1    207
2    297
3    198
4     99
5    891
Name: degisken1, dtype: int64

In [586]:
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [604]:
df_a = df.iloc[:,1:3]

In [608]:
df_a.transform(lambda x: (x-x.mean()) / x.std())

   degisken1  degisken2
0  -0.687871  -0.738461
1  -0.299074  -0.263736
2   0.000000  -0.015514
3  -0.328982  -0.235811
4  -0.657963  -0.704331
5   1.973890   1.957853

In [611]:
# apply

In [633]:
import pandas as pd
df = pd.DataFrame({
                   "degisken1": [10,23,33,22,11,99],
                   "degisken2": [100,253,333,262,111,969]},
                    columns = ["degisken1", "degisken2"])

In [635]:
df

   degisken1  degisken2
0         10        100
1         23        253
2         33        333
3         22        262
4         11        111
5         99        969

In [637]:
df.apply(np.sum)

degisken1     198
degisken2    2028
dtype: int64

In [639]:
df.apply(np.mean)

degisken1     33.0
degisken2    338.0
dtype: float64

In [653]:
import pandas as pd
df = pd.DataFrame({"gruplar": ["A","B","C","A","B","C"],
                   "degisken1": [10,23,33,22,11,99],
                   "degisken2": [100,253,333,262,111,969]},
                    columns = ["gruplar", "degisken1", "degisken2"])

In [655]:
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [657]:
df.groupby("gruplar").apply("sum")

         degisken1  degisken2
gruplar
A               32        362
B               34        364
C              132       1302

## pivot tables

In [660]:
import pandas as pd
import seaborn as sd
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [666]:
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [672]:
titanic.groupby(["sex","class"], observed=False)[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [680]:
# with pivot

In [678]:
titanic.pivot_table("survived", index = "sex", columns = "class", observed=False)

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [684]:
titanic.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [686]:
age = pd.cut(titanic["age"], [0, 18, 90])
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 90.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64, right]): [(0, 18] < (18, 90]]

In [694]:
titanic.pivot_table("survived", ["sex", age], "class", observed=False)

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663